package lab4.l1;

/**
  Реалізувати із застосування узагальненого програмування  ієрархію Java-класів для транспортних засобів, які можуть перевозити різні
  типи пасажирів.  Є наступні транспортні засоби:
 1. автобус, 2. таксі, 3. пожежна машина,  4. міліцейська машина.
  У цих транспортних засобах можуть їздити наступні  види пасажирів:
 1. звичайний пасажир, 2. пожежник, 3. міліціонер.
  Автобус та таксі можуть перевозити будь-яких пасажирів, пожежна машина – тільки пожежників, міліцейська машина – тільки міліціонерів.
  Реалізувати на основі узагальненого програмування (generics) вказані обмеження щодо перевозки пасажирів.
  Для класів транспортних засобів реалізувати наступні функції:
  - Кожний транспортний засіб має обмежену кількість місць. Реалізувати функцію для отримання максимальної кількість місць
  та функцію для отримання кількості зайнятих місць.
  - Посадка пасажира у транспортний засіб. Якщо всі місця вже зайнято, функція повинна ініціювати виключну ситуацію.
  - Висадка пасажира із транспортного засобу. Функція повинна  ініціювати виключну ситуацію, якщо вказаний пасажир «не
  сидить» у транспортному засобі.
  Реалізувати модульні тести з наповнення транспортних засобів різними типами пасажирів  */
public class Lab4_demo
{
    public static void main(String[] args)

    {
           VCTaxi<Human> taxi = new VCTaxi<>(4); // создание такси ёмкостью 4 пассажира
           System.out.println("ёмкость такси="+taxi.maxSizeGet());   // проверяем ёмкостью такси

           Human Benson = new Human("Benson");  // создаём обычного пассажира
           taxi.put(Benson); // садим в машину (добавление в лист)

           HFireMan Din = new HFireMan ("Din"); // создаем пажарного
           taxi.put(Din);

           HPoliceMan Jack = new HPoliceMan ("Jack"); // создаем полицейского
           taxi.put(Jack);

           HPoliceMan Don = new HPoliceMan("Don");  // создаем полицейского

           System.out.println("в такси пассажиров="+taxi.size());
           taxi.remove(Benson);
           System.out.println("в такси пассажиров="+taxi.size());

           VCPoliceCar<HPoliceMan> PoliceCar = new VCPoliceCar<>(2); //создание пожарной машины ёмкостью 2 пассажира
           System.out.println();
           System.out.println("ёмкость полицейской машины="+PoliceCar.maxSizeGet());
           System.out.println("в полицейской машине пассажиров="+PoliceCar.size());
           PoliceCar.put(Don);
           System.out.println("в полицейской машине пассажиров="+PoliceCar.size());
           PoliceCar.remove(Don);

    }
}
